
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Управленческий.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗатратыСписокПроектов.Проект КАК Проект,
		|	СУММА(ЗатратыСписокПроектов.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Затраты.СписокПроектов КАК ЗатратыСписокПроектов
		|ГДЕ
		|	ЗатратыСписокПроектов.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗатратыСписокПроектов.Проект";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Управленческий.ПрибылиУбытки;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Проекты] = Выборка.Проект;
		Движение.СчетКт = ПланыСчетов.Управленческий.ОбщехозяйственныеЗатраты;
		Движение.Сумма = Выборка.Сумма;
	КонецЦикла;
	
КонецПроцедуры
